#pragma once

#include <cstdint>
#include <memory>
#include <string>
#include <vector>

#include "rknn_api.h"

/*
br_model - модуль пост-процессинга результата модели.

Немного полезного:
1. Масштабирование входного кадра.
Модель и камера в своем входном/выходном разрешении могут различаться. Используется метод letterbox для устранения этой проблемы.
Как это работает коротко:
1.1. Нам надо уменьшить/увеличить кадр со входа до разрешения модели. Сохраняя пропорции при этом, иначе детекция поедет. Занимается этим RGA.
1.2. Допустим, RGA смог конвертировать кадр. Но из-за сохранения пропорций, он мог не вписаться в разрешение модели. Ширина, например, ок, а высота стала меньше.
1.3. Используем метод letterbox для вписывания кадра. Как это работает:
   ┌──────────────────────┐  ← вход модели 640×640
   │     серые поля       │
   │  ┌────────────────┐  │
   │  │                │  │
   │  │   кадр 640×360 │  │  ← по факту сюда лёг кадр
   │  │                │  │
   │  └────────────────┘  │
   │     серые поля       │
   └──────────────────────┘
где:
кадр 640х360 - кадр по факту от RGA
вход модели 640х640 - фактический и ожидаемый размер буфера под вход
серые поля - дополненные для вписывания кадра 640х360 в кадр 640х640 поля. Как правило равняется цвету таких же полей при обучении.

Примечание: по факту добавлением полей и уменьшением занимается только RGA. Мощный блок.

После данного мероприятия мы получаем во входе модели нормальный (с сохранением пропорций) небольшой кадр с пустыми полями.

Параметры из настроек: scale, pad_x, pad_y, как раз описывают насколько сильно нам пришлось вписать кадр. И куда мы его, собственно, вписали.

2. Выходные тензоры.
Результат модели - тензоры. Их может быть N штук. Для yolov5 - 3.
Конкретно под yolo - в каждом из тензоров разная сетка детекции.
*/


class br_model
{
public:
    /*
    Прямоугольник.
    */
    struct rect
    {
        int left;
        int top;
        int right;
        int bottom;
    };

    /*
        Детекция.
    */
    struct detection
    {
        rect box; // Прямоугольник детекции
        float prop; // Уверенность 
        std::string cls_id; // Номер класса распознования
    };

    /*
    Псевдоним под список детекций
    */
    using detection_list = std::vector<detection>;

    /*
    Настройки модели.
    */
    struct settings
    {
        std::string _path_to_model; // путь до файла модели
        uint16_t _width_model = 0; // Размер ширины кадра под вход модели (именно с такими размерами выделяется блок от RGA под вход модели)
        uint16_t _height_model = 0; // Размер высоты кадра под вход модели (именно с такими размерами выделяется блок от RGA под вход модели)
        float _box_thresh = 0; // Порог уверенности детекции (ниже отбрасываем)
        float _nms_thresh = 0; // Порог подавления дубликатов (NMS через IoU: если две рамки одного класса пересекаются СИЛЬНО, слабая выбрасывается)
        int _max_detections = 0; // Максимальное количество детекций
        std::string _path_to_labels; // путь до файла с названиями классов
        std::string _path_to_anchors; // путь до файла с якорями голов модели
        uint16_t _width = 0; // Ширина кадра (размеры на выход видеопотока!)
        uint16_t _height = 0; // Высота кадра (размеры на выход видеопотока!)
        float _scale = 0; // Как сильно масштабирован кадр под вход. Так как мы можем получать с камеры не в разрешении под модель, проводит масштабирование с сохр. пропорций. 
        uint16_t _pad_x = 0; // Отступ по X (слева и справа) масштабированного кадра
        uint16_t _pad_y = 0; // Отступ по Y (сверху и снизу) масштабированного кадра
    };

    /*
    Выходной тензор.
    */
    struct tensor
    {
        const int8_t* _data; // Указатель на данные тензора.
        const uint32_t* _dims; // Размерность тензора. NHWC раскладка у нас: [1 (сколько кадров за раз), высота сетки, ширина сетки, каналы].
        uint32_t _n_dims; // Сколько размерностей заполнено в _dims. На будущее, для yolo 4.
        int32_t _zp; // zero-point - что считать нулем при квантовании int8 в float и обратно.
        float _scale; // коэф. квантование.
    };

    /*
    Информация от самой модели и указатели на выходные тензоры.
    */
    struct model_info
    {
        int _input_width; // ширина модели по факту от самой модели
        int _input_height; // высота модели по факту от самой модели
        int _input_channels; // каналов во входе (3 для RGB).
        bool _is_quant; // квантованная модель или нет
        const rknn_tensor_attr* _output_attrs; // атрибуты выходных тензоров
        rknn_tensor_mem* const* _output_mems; // память на выходные тензоры
        size_t _output_count; // сколько выходных тензоров у модели
    };

    br_model() = default;
    virtual ~br_model() = default;

    /*
    Понятно.
    */
    void set_settings(const settings settings) { _settings = settings; }

    /*
    Получить путь до модели.
    */
    const std::string& get_model_path() const { return _settings._path_to_model; }

    /*
    Получить ширину входа модели.
    */
    uint16_t get_input_width() const { return _settings._width_model; }

    /*
    Получить высоту входа модели.
    */
    uint16_t get_input_height() const { return _settings._height_model; }

    /*
    Инициализация общей части.
    */
    bool init(const model_info& model_info);

    /* Разобрать выходные тензоры в детекции.
    detections - ссылка на вектор, где будут найденные детекции после разбора.
    */
    virtual bool process(detection_list& detections) = 0;

    /*
    Получить имя класса детекции по его ID.
    */
    virtual const char* get_class_name(const int cls_id) const = 0;

protected:
    /*
    Инициализация реализации.
    */
    virtual bool setup(const model_info& model_info) = 0;

    /*
    Настройки.
    */
    settings _settings;

    /*
    Выходные тензоры.
    */
    std::vector<tensor> _tensors;
};

/*
Создание модели.
TODO: переделать на нормальную фабрику.
*/
std::unique_ptr<br_model> br_model_create(const std::string& type);
