#pragma once

#include <cstdint>
#include <string>

extern "C"
{
    #include "rk_comm_mb.h"
    #include "rk_mpi_mb.h"
}

#include "br_hook_shared.h"
#include "br_model.h"

/*
br_hook - инит и управление юзер-скриптами пост-обработки 'чистого' кадра/кадра с детекций.

Полезное:
1. Базовый скрипт - обертка над юзер скриптом, которая подготавливает все данные с рантайма. hook_main.py.
2. Юзер-скрипт - собственно, полезная нагрузка от юзера.
*/

class br_hook
{
public:
    /*
    Чтение из hook.ini.
    */
    struct settings
    {
        bool _is_enabled = false; // false - нет обработки юзер-скриптом.
        /*
        async - режим, когда кадры идут на трансляцию, даже если скрипт не готов. Кадры на видеопоток берутся с VI.
        sync - режим, когда кадры идут на трансляцию только когда скрипт выполнил успешную пост-обработку, кадры на видеопоток берутся с блока памяти скрипта. Весь конвеер обработки замирает в ожидании кадра от скрипта.
        */
        bool _is_async = true; // режим: false - ждать скрипт, true - не ждать
        // Путь до юзер-скрипта. Имя входной функции пользователя должно быть строго: draw с двумя параметрами, сигнатуру см. в примере.
        std::string _path_script = "./hook_user.py";
        // Путь до питона, ищется в PATH. 
        std::string _path_python = "python3"; 
        // Сколько ждем кадр в синхронном режиме. 
        uint32_t _timeout_ms = 50; 
        // Сколько ждем кадр в асинхронном режиме.
        uint32_t _stuck_ms = 2000;
        // Сколько ждем инициализации базового скрипта.
        uint32_t _start_ms = 5000;
    };

    explicit br_hook();
    ~br_hook();

    /*
    Выставить настройки.
    */
    void set_settings(const settings settings);

    /*
    Инициализация. Все внутри.
    @width, @height - кадр с камеры.
    @ptr_blk_frame - указатель на блок памяти (отдельный от VI и NPU) под кадр для скрипта.
    */
    bool init(const uint16_t width, const uint16_t height, const MB_BLK ptr_blk_frame);

    /*
    Освободить ресурсы.
    */
    bool release();

    /*
    Скрипту разрешено выполнение.
    */
    bool is_enabled() const;

    /*
    Режим работы асинхронный.
    */
    bool is_async() const;

    /*
    Проверка скрипта на наличие хоть какой-то жизни.
    */
    void poll();

    /*
    Свободен ли блок памяти для кадров скрипта.
    */
    bool is_free() const;

    /*
    Передать скрипту последний кадр.
    Детекции передаются каждый раз последние. Даже если NPU не успел. Иначе мерцает пост-обработка.
    */
    void submit(const br_model::detection_list& detections);

    /*
    Асинхронный режим: проверить, не готов ли там скрипт кадр обработанный отдать.
    */
    bool take_ready();

    /*
    Синхронный режим: ждем ответа скрипта с кадром.
    */
    bool wait();

private:
    /*
    Состояние блока памяти скрипта. Ну и самого скрипта с точки зрения обработки.
    */
    enum class own
    {
        none, // блок памяти под скрипт свободен, можно класть кадр
        script, // кадр у скрипта, работа идет
        dropped, // вышли за таймаут, кадр дропаем
    };

    /*
    Текущее время в микросекундах.
    */ 
    uint64_t get_current_time_us() const;

    /* 
    Достаем путь до базового скрипта.
    Если не получилось - просто вернет его имя.
    */
    std::string get_main_script_path() const;

    /*
    Собственно старт базового скрипта. 
    Юзер-скрипт запускается там.
    */
    bool spawn_script();

    /*
    Перезапуск базового скрипта. 
    @reason почему рестартуем.
    */
    bool restart_script(const char* reason);

    /*
    Тупая фигня с отловом времени изменения скрипта. Ничего лучше на первое время не придумал.
    Сранивает метку времени изменения с меткой изменения со старта скрипта. 
    */
    bool is_script_changed();

    /* 
    Сбросить все, что связано с кадром, в shm. 
    */
    void reset_shared();

    /* 
    Блок памяти под кадр скрипта. 
    */
    MB_BLK _ptr_blk_frame = MB_INVALID_HANDLE;

    /* 
    Настройки. 
    */
    settings _settings;

    /* 
    Состояние блока памяти скрипта и самого скрипта. 
    */
    own _own_state = own::none;

    /*
    Флаг, что скрипт успешно запустился. 
    */
    bool _is_script_ready = false;

    /* 
    Указатель на шарную память. 
    */
    br_hook_shared* _shared = nullptr;

    /* 
    Дескриптор на шарную память. 
    */
    int _fd_shared = -1;

    /* 
    Размер шарной памяти. 
    */
    size_t _size_shared = 0;

    /*
    Сколько ждем времени до таймаута в синхронном режиме. В мкс.
    */
    uint64_t _limit_us_wait = 0;

    /* 
    Все о процессе скрипта.
    */
    int32_t _pid = -1; // PID
    uint64_t _time_us_filled = 0; // в какой момент кадр ушел скрипту.
    uint64_t _time_us_spawn = 0; // в какой момент подняли скрипт.
    uint64_t _time_us_mtime = 0; // в какой момент проверяли изменение скрипта.
    time_t _mtime_script = 0; // когда в последний раз меняли скрипт.
};
